Ludovic-Lesur/INSA/PSoC/BE_Systemes_Embarques.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>Comparator</name>
      <description>No description available</description>
      <baseAddress>0x0</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x0</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>Comparator_Comp_PM_ACT_CFG</name>
          <description>Active Power Mode Configuration Register 7</description>
          <addressOffset>0x400043A7</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>en_cmp</name>
              <description>Enable comparator. Populated subsystems are counted from the LSB, for example bit 0 corresponds to comparator 0</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Comparator_Comp_PM_STBY_CFG</name>
          <description>Standby Power Mode Configuration Register 7</description>
          <addressOffset>0x400043B7</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>en_cmp</name>
              <description>Enable comparator. Populated subsystems are counted from the LSB, for example bit 0 corresponds to comparator 0</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Comparator_Comp_TR0</name>
          <description>Comparator Trim Register_TR0</description>
          <addressOffset>0x40004630</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>trimA_4_0_</name>
              <description>Sets the trim value to be added to the P-type load for offset calibration</description>
              <lsb>0</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRIMA_0</name>
                  <description>Does not add any offset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIMA_POS_SIDE_1</name>
                  <description>Adds offset of ~1mV to the positive side</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIMA_POS_SIDE_2</name>
                  <description>Adds offset of ~2mV to the positive side</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIMA_POS_SIDE_3</name>
                  <description>Adds offset of ~3mV to the positive side</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIMA_POS_SIDE_4</name>
                  <description>Adds offset of ~4mV to the positive side</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIMA_POS_SIDE_5</name>
                  <description>Adds offset of ~5mV to the positive side</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIMA_POS_SIDE_6</name>
                  <description>Adds offset of ~6mV to the positive side</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIMA_POS_SIDE_7</name>
                  <description>Adds offset of ~7mV to the positive side</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIMA_POS_SIDE_8</name>
                  <description>Adds offset of ~8mV to the positive side</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIMA_NEG_SIDE_1</name>
                  <description>Adds offset of ~0mV to the negative side</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIMA_NEG_SIDE_2</name>
                  <description>Adds offset of ~1mV to the negative side</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIMA_NEG_SIDE_3</name>
                  <description>Adds offset of ~2mV to the negative side</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIMA_NEG_SIDE_4</name>
                  <description>Adds offset of ~3mV to the negative side</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIMA_NEG_SIDE_5</name>
                  <description>Adds offset of ~4mV to the negative side</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIMA_NEG_SIDE_6</name>
                  <description>Adds offset of ~5mV to the negative side</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIMA_NEG_SIDE_7</name>
                  <description>Adds offset of ~6mV to the negative side</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIMA_NEG_SIDE_8</name>
                  <description>Adds offset of ~7mV to the negative side</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIMA_NEG_SIDE_9</name>
                  <description>Adds offset of ~8mV to the negative side</description>
                  <value>18</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>Comparator_Comp_TR1</name>
          <description>Comparator Trim Register_TR1</description>
          <addressOffset>0x40004631</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>trimB_4_0_</name>
              <description>Sets the trim value to be added to the N-type load for offset calibration</description>
              <lsb>0</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRIMB_0</name>
                  <description>Does not add any offset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIMB_NEG_SIDE_1</name>
                  <description>Adds offset of ~1mV to the negative side</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIMB_NEG_SIDE_2</name>
                  <description>Adds offset of ~2mV to the negative side</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIMB_NEG_SIDE_3</name>
                  <description>Adds offset of ~3mV to the negative side</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIMB_NEG_SIDE_4</name>
                  <description>Adds offset of ~4mV to the negative side</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIMB_NEG_SIDE_5</name>
                  <description>Adds offset of ~5mV to the negative side</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIMB_NEG_SIDE_6</name>
                  <description>Adds offset of ~6mV to the negative side</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIMB_NEG_SIDE_7</name>
                  <description>Adds offset of ~7mV to the negative side</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIMB_NEG_SIDE_8</name>
                  <description>Adds offset of ~8mV to the negative side</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIMB_9</name>
                  <description>Does not add any offset</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIMB_POS_SIDE_1</name>
                  <description>Adds offset of ~1mV to the positive side</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIMB_POS_SIDE_2</name>
                  <description>Adds offset of ~2mV to the positive side</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIMB_POS_SIDE_3</name>
                  <description>Adds offset of ~3mV to the positive side</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIMB_POS_SIDE_4</name>
                  <description>Adds offset of ~4mV to the positive side</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIMB_POS_SIDE_5</name>
                  <description>Adds offset of ~5mV to the positive side</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIMB_POS_SIDE_6</name>
                  <description>Adds offset of ~6mV to the positive side</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIMB_POS_SIDE_7</name>
                  <description>Adds offset of ~7mV to the positive side</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIMB_POS_SIDE_8</name>
                  <description>Adds offset of ~8mV to the positive side</description>
                  <value>18</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>Comparator_Comp_CR</name>
          <description>Comparator Control Register</description>
          <addressOffset>0x40005840</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>filt</name>
              <description>enables a glitch filter at the output of the comparator</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FILT_DISABLE</name>
                  <description>Disable glitch filter</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FILT_ENABLE</name>
                  <description>Enable glitch filter</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>hyst</name>
              <description>enables a hysteresis of 10mV typ</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HYST_DISABLE</name>
                  <description>Disable hysteresis</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HYST_ENABLE</name>
                  <description>Enable hysteresis</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>cal_en</name>
              <description>enables shorting of the two comparator inputs for trim calibration purposes</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CAL_EN_DISABLE</name>
                  <description>Disable calibration</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAL_EN_ENABLE</name>
                  <description>Enable calibration</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>mx_ao</name>
              <description>comparator sleep always-on logic mux control</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MX_AO_BYPASS</name>
                  <description>Bypass comparator sleep always-on logic</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MX_AO_ENABLE</name>
                  <description>Enable comparator sleep always-on logic</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>pd_override</name>
              <description>Power down override to allow comparator to continue operating during sleep</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PD_OVERRIDE_DISABLE</name>
                  <description>Don't override power down</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PD_OVERRIDE_ENABLE</name>
                  <description>Override power down</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>sel</name>
              <description>Selects the mode of operation of the comparator</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEL_SLOW</name>
                  <description>slow mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL_FAST</name>
                  <description>fast mode</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL_LP</name>
                  <description>ultra low power mode</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL_ILLEGAL</name>
                  <description>Illegal Mode</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>Comparator_Comp_SW0</name>
          <description>Comparator Analog Routing Register 0</description>
          <addressOffset>0x40005AC0</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>vp_ag7</name>
              <description>Connect positive voltage input to analog global of same side </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AG_NC</name>
                  <description>not connected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AG_CONNECTED</name>
                  <description>Connect to Analog Global</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>vp_ag6</name>
              <description>Connect positive voltage input to analog global of same side </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AG_NC</name>
                  <description>not connected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AG_CONNECTED</name>
                  <description>Connect to Analog Global</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>vp_ag5</name>
              <description>Connect positive voltage input to analog global of same side </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AG_NC</name>
                  <description>not connected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AG_CONNECTED</name>
                  <description>Connect to Analog Global</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>vp_ag4</name>
              <description>Connect positive voltage input to analog global of same side </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AG_NC</name>
                  <description>not connected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AG_CONNECTED</name>
                  <description>Connect to Analog Global</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>vp_ag3</name>
              <description>Connect positive voltage input to analog global of same side </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AG_NC</name>
                  <description>not connected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AG_CONNECTED</name>
                  <description>Connect to Analog Global</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>vp_ag2</name>
              <description>Connect positive voltage input to analog global of same side </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AG_NC</name>
                  <description>not connected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AG_CONNECTED</name>
                  <description>Connect to Analog Global</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>vp_ag1</name>
              <description>Connect positive voltage input to analog global of same side </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AG_NC</name>
                  <description>not connected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AG_CONNECTED</name>
                  <description>Connect to Analog Global</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>vp_ag0</name>
              <description>Connect positive voltage input to analog global of same side </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AG_NC</name>
                  <description>not connected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AG_CONNECTED</name>
                  <description>Connect to Analog Global</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
