Ludovic-Lesur/INSA/PSoC/BE_Systemes_Embarques.svd
        <register>
          <name>Comparator_Comp_SW2</name>
          <description>Comparator Analog Routing Register 2</description>
          <addressOffset>0x40005AC2</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>vp_abus1</name>
              <description>Connect positive voltage input to analog (local) bus of the same side</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ABUS_NC</name>
                  <description>not connected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ABUS_CONNECTED</name>
                  <description>Connect to Analog (local) Bus</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>vp_abus0</name>
              <description>Connect positive voltage input to analog (local) bus of the same side</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ABUS_NC</name>
                  <description>not connected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ABUS_CONNECTED</name>
                  <description>Connect to Analog (local) Bus</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>Comparator_Comp_SW3</name>
          <description>Comparator Analog Routing Register 3</description>
          <addressOffset>0x40005AC3</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>vn_vref1</name>
              <description>Connect negative voltage input to Voltage Reference 1</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VREF_NC</name>
                  <description>not connected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VREF_CONNECTED</name>
                  <description>Connect to Voltage Reference</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>vn_vref0</name>
              <description>Connect negative voltage input to Voltage Reference 0</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VREF_NC</name>
                  <description>not connected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VREF_CONNECTED</name>
                  <description>Connect to Voltage Reference</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>vn_amx</name>
              <description>Connect negative voltage input to Analog Mux Bus</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AMX_NC</name>
                  <description>not connected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AMX_CONNECTED</name>
                  <description>Connect to AMUXBUS</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>vp_refbuf</name>
              <description>Connect positive voltage input to CapSense reference buffer channel</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VP_REFBUF_ENABLED</name>
                  <description>disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VP_REFBUF_DISABLED</name>
                  <description>enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>vp_amx</name>
              <description>Connect positive voltage input to Analog Mux Bus</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AMX_NC</name>
                  <description>not connected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AMX_CONNECTED</name>
                  <description>Connect to AMUXBUS</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>Comparator_Comp_SW4</name>
          <description>Comparator Analog Routing Register 4</description>
          <addressOffset>0x40005AC4</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>vn_ag6</name>
              <description>Connect negative voltage input to analog global of same side</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AG_NC</name>
                  <description>not connected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AG_CONNECTED</name>
                  <description>Connect to Analog Global</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>vn_ag4</name>
              <description>Connect negative voltage input to analog global of same side</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AG_NC</name>
                  <description>not connected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AG_CONNECTED</name>
                  <description>Connect to Analog Global</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>vn_ag2</name>
              <description>Connect negative voltage input to analog global of same side</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AG_NC</name>
                  <description>not connected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AG_CONNECTED</name>
                  <description>Connect to Analog Global</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>vn_ag0</name>
              <description>Connect negative voltage input to analog global of same side</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AG_NC</name>
                  <description>not connected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AG_CONNECTED</name>
                  <description>Connect to Analog Global</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>Comparator_Comp_SW6</name>
          <description>Comparator Analog Routing Register 6</description>
          <addressOffset>0x40005AC6</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>vn_abus3</name>
              <description>Connect negative voltage input to analog (local) bus of the same side</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ABUS_NC</name>
                  <description>not connected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ABUS_CONNECTED</name>
                  <description>Connect to Analog (local) Bus</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>vn_abus2</name>
              <description>Connect negative voltage input to analog (local) bus of the same side</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ABUS_NC</name>
                  <description>not connected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ABUS_CONNECTED</name>
                  <description>Connect to Analog (local) Bus</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>Comparator_Comp_CLK</name>
          <description>Comparator Clock Control Register</description>
          <addressOffset>0x40005AC7</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>bypass_sync</name>
              <description>Bypass Synchronization</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BYPASS_SYNC_0</name>
                  <description>Synchronization not bypassed (Synchronization enabled)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BYPASS_SYNC_1</name>
                  <description>Synchronization bypassed (Synchronization disabled)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>clk_en</name>
              <description>Clock gating control</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLK_EN_0</name>
                  <description>disable clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_EN_1</name>
                  <description>enable clock</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>mx_clk</name>
              <description>Clock Selection</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MX_CLK_0</name>
                  <description>Select clk_a0 and clk_a0_dig</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MX_CLK_1</name>
                  <description>Select clk_a1 and clk_a1_dig</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MX_CLK_2</name>
                  <description>Select clk_a2 and clk_a2_dig</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MX_CLK_3</name>
                  <description>Select clk_a3 and clk_a3_dig</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MX_CLK_4</name>
                  <description>Select UDB generated clock</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MX_CLK_5</name>
                  <description>Reserved</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MX_CLK_6</name>
                  <description>Reserved</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MX_CLK_7</name>
                  <description>Reserved</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>Comparator_Comp_WRK</name>
          <description>Comparator output working register</description>
          <addressOffset>0x40005B96</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>cmp3_out</name>
              <description>Comparator Output</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>cmp2_out</name>
              <description>Comparator Output</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>cmp1_out</name>
              <description>Comparator Output</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>cmp0_out</name>
              <description>Comparator Output</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>